package com.clinical.constant;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.Collections;
import java.util.List;

public class Constant {

    public static final String SYMDESC="咳嗽；咳痰；痰中带血；咯血；胸闷；气短；声音嘶哑；发热；消瘦；恶病质；杵状指（趾）；关节肿胀、疼痛和触痛；异位促肾上腺皮质激素（ACTH）分泌综合征；肌无力；周围性水肿；高血压病；糖尿病；低钾性碱中毒；异位促性腺激素分泌综合征；男性乳腺发育；阴茎异常勃起；异位甲状旁腺激素分泌综合征；高钙血症；低磷血症；食欲减退；恶心呕吐；腹痛；烦渴；体重下降；心动过速；心律不齐；烦躁不安；精神错乱；异位胰岛素分泌综合征；亚急性低血糖；精神错乱；幻觉；头痛；类癌综合征；支气管痉挛性哮喘；皮肤潮红；阵发性心动过速；水样腹泻；神经-肌肉综合征（Eaton-Lambert综合征）；肌力减退；易疲劳；肢端疼痛无力；眩晕；眼球震颤；共济失调；步履困难；痴呆；异位生长激素综合征；肥大性骨关节病；抗利尿激素分泌异常综合征；低钠血症；水中毒；黑棘皮病；皮肤炎；色素沉着；硬皮病；掌跖皮肤过度角化症；静脉栓塞；静脉炎；非细菌性栓塞性心内膜炎；凝血功能异常；贫血；紫癜；红细胞增多；类白血病样反应；淋巴结转移部位结节、包块；窒息；吞咽困难；饮水呛咳；胸腔积液；心包积液；胸痛；骨疼痛；头痛；呕吐；阻塞性肺炎；肺不张；气胸；上腔静脉综合征；颜面部浮肿；胸部静脉曲张；晕厥；眩晕；上腹部静脉曲张；颈部静脉曲张；嗜睡；激惹；意识状态改变；腰痛；肾功能不全；肝区疼痛；梗阻性黄疸；胰腺炎；癫痫；共济失调；偏瘫；失语；昏厥；呼吸困难；肢体功能障碍；四肢行动困难；动作震颤；发音困难；心前区疼痛；肋下疼痛；腹部疼痛；心包填塞；心悸；颈面部静脉怒张；心界扩大；心音低远；肝肿大；腹水；Horner综合征；瞳孔缩小；上眼睑下垂；眼球内陷；颜面部无汗；臂丛神经压迫症；上肢烧灼样（放射性）疼痛；上肢感觉异常；上肢营养性萎缩；膈肌麻痹；气急；膈肌矛盾运动；声带麻痹；肩臂疼痛；Pancoast综合征；臂无力；臂轻瘫；肌肉萎缩；肺梗死；库欣综合征；皮质醇增多症；上腔静脉综合症";
    public static final String SYMDESC1="QT间期延长；ST-T改变；ST段抬高；ST段压低；背痛；鼻出血；鼻衄；变异性心绞痛；憋闷感；濒死感；病理性Q波；病态窦房结综合征；不稳定心绞痛；沉重感；抽搐；传导阻滞；喘累；喘息；大汗；窦速；端坐呼吸；多尿；扼颈感；恶心；乏力；烦躁；房颤；28 房扑；房速；房早；粉红色泡沫痰；腹胀；咯痰；咯血；股动脉搏动延迟出现或缺如；冠脉狭窄；冠状动脉狭窄；冠状动脉支架植入术；行走困难；黑蒙；黑朦；呼吸困难；昏厥；活动后喘累；活动后呼吸困难；活动后心悸气促；活动后心累气促；活动后胸闷；活动后胸痛；活动耐量减低；活动耐量减退；活动受限；急性冠脉综合征；继发性高血压；甲状旁腺功能亢进；甲状腺功能减退；甲状腺功能亢进；尖端扭转性室速；肩背部疼痛；紧缩感；颈部紧缩感；绝经期综合征；咳嗽；劳力型心绞痛；劳力性呼吸困难；劳力性心悸气促；劳力性心绞痛；劳力性胸闷；劳力性胸痛；漏跳；纳差；呕吐；疲乏；期前收缩；气憋；气促；气短；气短；气急；气紧；强迫坐位；缺血性心肌病；上腹不适；上肢放射痛；少尿/尿量减少；肾动脉狭窄；肾性高血压；食欲减退；食欲缺乏；视乳头水肿；室颤；室上性心动过速；室速；室早；嗜铬细胞瘤；水肿； 痰血；痰中带血；停搏；头昏；头晕；突发突止；下肢血压明显低于上肢；腺垂体功能亢进；心动过速；心慌；心肌梗塞；心肌梗死；心肌缺血；心悸；心绞痛；心累；心累气促；心律不齐；心前区不适；心前区疼痛；心前区压榨感；心源性猝死；心源性肝硬化；心源性休克；心脏杂音；胸部不适；胸部束带感；胸骨后疼痛；胸闷；胸腔积液；胸水；胸痛；眩晕；血管杂音；血压升高；压迫感；牙痛；眼底出血；夜间不能平卧；夜间阵发性呼吸困难；异常Q波；逸搏；意识丧失；隐匿型冠心病；预激综合征；原发性醛固酮增多症；晕倒；晕厥；运动耐量减低；运动障碍；早搏；阵发性心动过速；窒息感；周围血管搏动；左臂内侧放射痛；左肩放射痛；左肩痛";

   public static String[] ICD10_ID={"C00","C01","C02","C03","C04","C05","C06","C07","C08","C09",
           "C10","C11","C12","C13","C14","C15","C16","C17","C18","C19",
           "C20","C21","C22","C23","C24","C25","C26","C27","C28","C29",
           "C30","C31","C32","C33","C34","C35","C36","C37","C38","C39",
           "C40","C41","C42","C43","C44","C45","C46","C47","C48","C49",
           "C50","C51","C52","C53","C54","C55","C56","C57","C58","C59",
           "C60","C61","C62","C63","C64","C65","C66","C67","C68","C69",
           "C70","C71","C72","C73","C74","C75",
                 "C81","C82","C83","C84","C85","C86","C87","C88","C89",
           "C90","C91","C92","C93","C94","C95","C96","C97","C98","C99",
           "D00","D01","D02","D03","D04","D05","D06","D07","D08","D09",
           "D37","D38","D39","D40","D41","D42","D43","D44","D45","D46","D47","D48"
   };

    public static final List<String> gxyKeyword = Arrays.asList(
            "高血压",
            "高血压2级",
            "高血压1级",
            "高血压病1级（中危）",
            "高血压3级",
            "肾性高血压",
            "良性高血压",
            "高血压病3级（极高危）",
            "高血压病2级（极高危）",
            "继发性高血压",
            "高血压病2级（高危）",
            "原发性高血压",
            "特发性(原发性)高血压",
            "高血压性肾病",
            "高血压病1级（高危）"
    );
    public static final List<String> tnbKeyword = Arrays.asList(
            "糖尿病",
            "2型糖尿病",
            "糖尿病伴有肾的并发症",
            "糖尿病伴神经系统并发症",
            "糖尿病性周围神经病",
            "糖尿病性肾病"
    );
    public static final List<String> xzbKeyword = Arrays.asList(
            "心脏病",
            "冠状动脉粥样硬化性心脏病",
            "心房颤动",
            "心绞痛",
            "窦性心动过速",
            "肺源性心脏病",
            "心房颤动[心房纤颤]",
            "心肌梗死",
            "心房扑动",
            "心律失常",
            "阵发性心房颤动",
            "心包炎",
            "阵发性心房纤颤",
            "心悸",
            "心血管疾病",
            "高血压性心脏病",
            "心功能不全",
            "心肌供血不足",
            "心脏瓣膜病",
            "急性心肌梗死",
            "心脏停搏",
            "室上性心动过速",
            "急性高侧壁心肌梗死",
            "窦性心动过缓",
            "风湿性心脏病",
            "急性左心衰竭",
            "扩张型心肌病",
            "梗阻性肥厚型心肌病",
            "心力衰竭",
            "慢性心力衰竭",
            "心肌炎",
            "窦性心律失常",
            "先天性心脏畸形",
            "病毒性心肌炎",
            "慢性心房颤动",
            "不稳定型心绞痛",
            "缩窄性心包炎",
            "感染性心内膜炎",
            "房性心动过速",
            "风湿性心脏病，其他特指的"
    );
    public static final List<String> gyKeyword = Arrays.asList(
            "肝炎",
            "病毒性肝炎",
            "乙型病毒性肝炎",
            "慢性乙型病毒性肝炎",
            "乙型肝炎小三阳",
            "慢性肝炎",
            "慢性丙型病毒性肝炎",
            "急性黄疸型肝炎",
            "甲型肝炎，不伴有肝昏迷",
            "乙型肝炎大三阳",
            "慢性病毒性肝炎",
            "急性甲型病毒性肝炎",
            "酒精性肝炎",
            "病毒性肝炎重叠感染",
            "慢性重型肝炎",
            "药物性肝炎",
            "重症肝炎",
            "病毒性肝炎急性重型(暴发型)",
            "急性黄疸型乙型病毒性肝炎",
            "慢性活动性肝炎",
            "急性黄疸型甲型病毒性肝炎",
            "急性病毒性肝炎",
            "胆汁淤积性肝炎"
    );


   public static List<String> getICD10LIST(){
       List<String> icd10List=new ArrayList<>();
       Collections.addAll(icd10List, ICD10_ID);
       return icd10List;
   }
}
